trade/src/DataProcessors/РаспознаваниеДокументов/РаспознаваниеДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РаспознаваниеДокументов</name>
</mdclass:DataProcessor>

trade/src/InformationRegisters/ПредставлениеЗаданийРаспознаваниеДокументов/ПредставлениеЗаданийРаспознаваниеДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПредставлениеЗаданийРаспознаваниеДокументов</name>
  <resources>
    <name>ДатаЗагрузки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ФайлыСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВОбработке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Загружено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Ошибок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Представление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Источник</name>
    <type>
      <types>EnumRef.ИсточникиПолученияФайлов</types>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторЗадания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

trade/src/InformationRegisters/СостоянияЗаданийРаспознаваниеДокументов/СостоянияЗаданийРаспознаваниеДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияЗаданийРаспознаваниеДокументов</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыНаСервисеРаспознаваниеДокументов</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторИсточникаРаспознавания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторЗадания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

trade/src/InformationRegisters/ИсходныеДанныеЗаданийРаспознаваниеДокументов/ИсходныеДанныеЗаданийРаспознаваниеДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсходныеДанныеЗаданийРаспознаваниеДокументов</name>
  <resources>
    <name>ИдентификаторЗадания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаЗагрузки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИсходныйФайл</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>DefinedType.Пользователь</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МобильноеПриложение</name>
    <type>
      <types>CatalogRef.МобильныеПриложенияРаспознаванияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВОбработке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьИдентификаторЗадания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьНомерФайла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

trade/src/Enums/ИсточникиПолученияФайлов/ИсточникиПолученияФайлов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИсточникиПолученияФайлов</name>
  <enumValues>
    <name>Вручную</name>
  </enumValues>
  <enumValues>
    <name>ИзПапки</name>
  </enumValues>
  <enumValues>
    <name>МобильноеПриложение</name>
  </enumValues>
  <enumValues>
    <name>ЭлектроннаяПочта</name>
  </enumValues>
  <enumValues>
    <name>ВнешняяСистема</name>
  </enumValues>
</mdclass:Enum>

trade/src/Enums/СтатусыНаСервисеРаспознаваниеДокументов/СтатусыНаСервисеРаспознаваниеДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыНаСервисеРаспознаваниеДокументов</name>
  <enumValues>
    <name>Загружено</name>
  </enumValues>
  <enumValues>
    <name>Обрабатывается</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Отменено</name>
  </enumValues>
</mdclass:Enum>

trade/src/DataProcessors/РаспознаваниеДокументов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ОтправитьФайлыНаРаспознавание(Файлы) Экспорт
	
	ДлительныеОперации.СообщитьПрогресс(, НСтр("ru = 'Создание задания распознавания документов...'"));
	
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("Пользователь", Пользователи.ТекущийПользователь());
	
	Источник = Перечисления.ИсточникиПолученияФайлов.Вручную;
	
	Попытка
		
		ИменаФайлов = Новый Массив;
		Для Каждого Файл Из Файлы Цикл
			ИменаФайлов.Добавить(Файл.ИмяФайла);
		КонецЦикла;
		
		ЗаписьЖурналаРегистрации(
			РаспознаваниеДокументов.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Информация, , ,
			НСтр("ru = 'Отправлены файлы для распознавания:'") + Символы.ПС + СтрСоединить(ИменаФайлов, ", ")
		);
		
		ДатаСоздания = ТекущаяУниверсальнаяДата();
		
		ИдентификаторЗадания = РаспознаваниеДокументовSDK.СоздатьЗаданиеРаспознавания(ИменаФайлов, ДатаСоздания);
		
		ЗаписьЖурналаРегистрации(
			РаспознаваниеДокументов.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Информация, , ,
			НСтр("ru = 'Получен идентификатор нового задания:'") + Символы.ПС + ИдентификаторЗадания
		);
		
		РегистрыСведений.ПредставлениеЗаданийРаспознаваниеДокументов.Записать(
			ИдентификаторЗадания, ДатаСоздания, ИменаФайлов, Источник);
		
		Результат = РаспознаваниеДокументовSDK.ПолучитьСостояниеОбработкиЗадания(ИдентификаторЗадания);
		
		Если Результат.ОбработкаЗавершена Или Результат.АдресаЗагрузкиФайлов.Количество() = 0 Тогда
			ВызватьИсключение НСтр("ru = 'Произошла ошибка при создании задания. Попробуйте повторить позже.'");
		КонецЕсли;
		
		РегистрыСведений.СостоянияЗаданийРаспознаваниеДокументов.ИзменитьСтатусОбработкиЗадания(
			ИдентификаторЗадания,
			Перечисления.СтатусыНаСервисеРаспознаваниеДокументов.Обрабатывается
		);
		
		ИндексФайла = 0;
		КоличествоФайлов = Файлы.Количество();
		Для Каждого АдресЗагрузкиФайла Из Результат.АдресаЗагрузкиФайлов Цикл
			
			ДлительныеОперации.СообщитьПрогресс(, СтрШаблон(
				НСтр("ru = 'Отправка файла %1 (%2 из %3)...'"),
				Файлы[ИндексФайла].ИмяФайла,
				ИндексФайла + 1,
				КоличествоФайлов
			));
			
			Попытка
				ИдентификаторФайла = РаспознаваниеДокументовSDK.ЗагрузкаФайлаПоАдресу(
					АдресЗагрузкиФайла,
					Файлы[ИндексФайла].ДвоичныеДанные
				);
			Исключение
				// Не удалось загрузить файл по адресу, который выдал сервис
				Продолжить;
			КонецПопытки;
			
			РегистрыСведений.ИсходныеДанныеЗаданийРаспознаваниеДокументов.Записать(
				ИдентификаторФайла,
				ИдентификаторЗадания,
				ДатаСоздания,
				Файлы[ИндексФайла],
				ПараметрыЗадания
			);
			
			ИндексФайла = ИндексФайла + 1;
			
		КонецЦикла;
		
	Исключение
		
		ЗаписьЖурналаРегистрации(
			РаспознаваниеДокументов.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка, , ,
			НСтр("ru = 'Ошибка при создании задания распознавания'") + Символы.ПС
				+ ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())
		);
		
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Произошла ошибка при отправке:
			           |%1'"),
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке())
		);
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
